def add_task(task_name, task_list=[]):
    task_list.append(task_name)
    print(task_list)

add_task("Read the book")
add_task("Send the letter")
add_task("Go to the gym")



# Python-ში ნაგულისხმევი მნიშვნელობა იქმნება ერთხელ, ფუნქციის განსაზღვრისას და არა მისი ყოველი გამოძახებისას.
# თუ ფუნქციას ვიძახებთ და task_list პარამეტრში არაფერს არ გადავცემთ, (ამ დროს ფუნქცია გამოიყენებს Default მნიშვნელობას) მაშინ  
# ყოველი გამოძახებისას გამოყენებულ იქნება პირველ ჯერზე შექმნილი ობიექტი.
# შედეგად ყველა გამოძახება გამოიყენებს ერთი და იმავე task_list ობიექტს და ამიტომ ყველა ელემენტი ჩაიწერება მასში.